Revit 2027 API
ServerChangeCause Enumeration
 Indicates the cause for the active server to be changed
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ServerChangeCause
Public Enumeration ServerChangeCause
public enum class ServerChangeCause
type ServerChangeCause
Members
Member name | Value | Description
ImposedChange | 0 |  The active server is being changed as a result of other operations in Revit.
UserChange | 1 |  The change of the active server has been explicitly requested by the end user.
See Also
Reference
Autodesk.Revit.DB.ExternalService Namespace